# 18113. 그르다 김가놈

# 문제
# 정래는 김밥가게 “그르다 김가놈”에 납품할 김밥을 만드는 김밥 공장을 운영한다. 정래는 김밥 양쪽 끝을 “꼬다리”라고 부른다. 그리고 꼬다리를 잘라낸 김밥을 “손질된 김밥”이라고 부른다.
# 공장에서는 김밥 N개에 대해서, 김밥 꼬다리를 잘라내고 손질된 김밥을 김밥조각으로 만드는 작업을 한다. 꼬다리를 잘라낼 때에는 양쪽에서 균일하게 K cm만큼 잘라낸다. 만약 김밥의 길이가 2K cm보다 짧아서 한쪽밖에 자르지 못한다면, 한쪽만 꼬다리를 잘라낸다. 김밥 길이가 K cm이거나 그보다 짧으면 그 김밥은 폐기한다.
# 손질된 김밥들은 모두 일정한 길이 P로 잘라서 P cm의 김밥조각들로 만든다. P는 양의 정수여야 한다. 정래는 일정한 길이 P cm로 자른 김밥조각을 최소 M개 만들고 싶다. P를 최대한 길게 하고 싶을 때, P는 얼마로 설정해야 하는지 구하시오.
#
# 입력
# 첫 번째 줄에 손질해야 하는 김밥의 개수 N, 꼬다리의 길이 K, 김밥조각의 최소 개수 M이 주어진다. (1 ≤ N ≤ 10^6, 1 ≤ K, M ≤ 10^9, N, K, M은 정수)
# 두 번째 줄부터 김밥의 길이 L이 N개 주어진다. (1 ≤ L ≤ 10^9, L은 정수)
#
# 출력
# 김밥조각의 길이 P를 최대로 할 때, P를 출력한다. 만족하는 P가 없는 경우, -1을 출력한다.

############################################################################################

import sys

def check(x):
    total = 0
    for i in li:
        total += i // x
    return total >= m

n, k, m = map(int, sys.stdin.readline().strip().split())
li = []

# 문제의 조건에 따라 자르게 될 김밥의 길이를 제한해주었다.
for i in range(n):
    kb = int(sys.stdin.readline().strip())
    if kb > k * 2 and (kb - k * 2) != k:
        li.append(kb - k * 2)
    elif kb > k and (kb - k) != k:
        li.append(kb - k)

s = 1
e = 1 << 50
ans = -1
while s <= e:
    mid = (s + e) // 2

    if check(mid):
        ans = mid
        s = mid + 1
    else:
        e = mid - 1

print(ans)
